import { useState } from "react";
import FooterColTitle from "../FooterColTilte";

export default function AboutUs(){
    const [ show , setShow ] = useState(false)
    return(
        <div className="w-[58%] ">
            <FooterColTitle title="فروشگاه اینترنتی پروشاپ رویال، تحولی عظیم در قالب‌های فروشگاهی وردپرس" />
            <div>
                <p className="text-justify leading-loose p-2 text-sm">
                فروشگاه اینترنتی پروشاپ رویال بهترین بستر برای خرید اینترنتی کالاهای مورد نیاز شما در ایران است . "اصل بودن کالا ، "گارانتی بازگشت" ، " ارسال سریع" و "مشاوره تخصصی" از ویژگی های مهم و اساسی در پروشاپ رویال از نخستین روز تأسیس بوده و تمام سعی خود را کرده
                </p>
               
                <div className={` ${show ? "h-max overflow-visible transition-all duration-1000" : " max-h-[0px] overflow-hidden" }`}>
                <p className="text-justify leading-loose p-2 text-sm">
                فروشگاه اینترنتی پروشاپ رویال بهترین بستر برای خرید اینترنتی کالاهای مورد نیاز شما در ایران است . "اصل بودن کالا ، "گارانتی بازگشت" ، " ارسال سریع" و "مشاوره تخصصی" از ویژگی های مهم و اساسی در پروشاپ رویال از نخستین روز تأسیس بوده و تمام سعی خود را کرده
                فروشگاه اینترنتی پروشاپ رویال بهترین بستر برای خرید اینترنتی کالاهای مورد نیاز شما در ایران است . "اصل بودن کالا ، "گارانتی بازگشت" ، " ارسال سریع" و "مشاوره تخصصی" از ویژگی های مهم و اساسی در پروشاپ رویال از نخستین روز تأسیس بوده و تمام سعی خود را کرده
                فروشگاه اینترنتی پروشاپ رویال بهترین بستر برای خرید اینترنتی کالاهای مورد نیاز شما در ایران است . "اصل بودن کالا ، "گارانتی بازگشت" ، " ارسال سریع" و "مشاوره تخصصی" از ویژگی های مهم و اساسی در پروشاپ رویال از نخستین روز تأسیس بوده و تمام سعی خود را کرده
                فروشگاه اینترنتی پروشاپ رویال بهترین بستر برای خرید اینترنتی کالاهای مورد نیاز شما در ایران است . "اصل بودن کالا ، "گارانتی بازگشت" ، " ارسال سریع" و "مشاوره تخصصی" از ویژگی های مهم و اساسی در پروشاپ رویال از نخستین روز تأسیس بوده و تمام سعی خود را کرده
                فروشگاه اینترنتی پروشاپ رویال بهترین بستر برای خرید اینترنتی کالاهای مورد نیاز شما در ایران است . "اصل بودن کالا ، "گارانتی بازگشت" ، " ارسال سریع" و "مشاوره تخصصی" از ویژگی های مهم و اساسی در پروشاپ رویال از نخستین روز تأسیس بوده و تمام سعی خود را کرده

                </p>
                </div>

                <div className="transition-all duration-800 p-2">
                    {show ? <button className="transition-all duration-500 hover:text-red-700" onClick={()=>setShow(false)}>مشاهده کم تر</button> :
                     <button  className="transition-all duration-500 hover:text-red-700" onClick={()=>setShow(true)}>مشاهده بیشتر</button>
                    }
                </div>
            </div>
          
        </div>
    )
}
