import Accordion from "../../modules/accordion/Accordion";

export default function Help({helpRef}){
    return(
        <div ref={helpRef} className="p-7 bg-white">
           <div className="">
                <h1 className="text-center mb-3 text-xl bakh-meduim">
                پرسش و پاسخ درباره این محصول
                </h1>
                <div className="bg-red-300 h-[2px] w-[120px] mb-1.5 mx-auto">
                </div>
                <div className="bg-red-300 h-[2px] w-[70px] mx-auto"></div>
           </div>

           <div className="w-[55%] mt-12 mx-auto">
               <Accordion 
                title="میزان مقاومت این محصول در برابر آب چقدر هست؟"
                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد."
               />
                <Accordion 
                title="آیا بعد از خرید نیاز به زجیستر کردن هست؟"
                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد."
               />
                 <Accordion 
                 title="آیا این محصول از زبان فارسی بشتیبانی می کند"
                 desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد."
               />
                 <Accordion 
                 title="به نظر شما آیا قیمت این محصول گران نیست"
                 desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد."
               />
                 <Accordion 
                  title="این محصول بیشتر برای چه رده سنی مناسب است؟"
                  desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد."
               />
           </div>
        </div>
    )
}